export default {
  CHANGE_LANGUAGE: 'English',
  SOCIAL_CLEANER: 'سوشال کلینر | پاکسازی شبکه اجتماعی',
  LANGUAGE: 'فارسی',
  LOGIN_VIA_TWITTER: 'ورود با توییتر',
  PREPARE_CREDENTIALS: 'در حال آماده سازی حساب کاربری، لطفا صبر کنید.',
  KILL_ACCOUNT: 'پاکسازی حساب کاربری غیرقابل بازگشت است',
  INTRO_ATTENTION:
    'این پیام فقط یکبار به شما نمایش داده خواهد شد، با دقت بخوانید',
  INTRO_DESCRIPTION:
    'سوشال کلینر یک ابزار امنیتی جهت پاکسازی پیام ها و توییت هایتان در شبکه اجتماعی توییتر است که به دلیل اوضاع وخیم ایران برای حفظ امنیت افراد تهیه شده است.',
  INTRO_GUIDE:
    'برای این که به سوشال کلینر اجازه دهید تا پیام ها و توییت هایتان را پاکسازی کند، باید مراحل زیر را طی کنید:',

  INTRO_LOGIN: 'ورود به توییتر از طریق سوشال کلینر.',
  INTRO_REDIRECT_BACK:
    'پس از این که ورود با موفقیت انجام شد و به سوشال کلینر بازگشتید، از طریق دکمه پاکسازی میتوانید فعالیت خود در توییتر را پاکسازی کنید.',
  INTRO_OFFLINE_CALL:
    'در صورت قطعی اینترنت، درخواست شما برای پاکسازی باز خواهد ماند و بعد از اتصال دوباره، سریعا این درخواست را به سرور ارسال میکند.',
  INTRO_LOCK_APPLICATION:
    'طی فرایند پاکسازی، امکان استفاده دوباره از سوشال کلینر وجود نخواهد داشت و اپلیکیشن در موبایل شما قفل میشود.',
  INTRO_CLEANUP:
    'پس از پاکسازی، همه اطلاعات شما از سرورهای ما پاکسازی میشود و هیچ ردی از شما باقی نخواهد ماند',

  INTRO_SHOW_TECHNICAL_DETAILS:
    'توجه به این نکته ضروریست که ما اقدامات امنیتی فراوانی انجام داده ایم تا حریم شخصی شما حفظ شود، این بدان معناست که ما هیچ داده ای از شما ذخیره نمیکنیم',

  INTRO_LOGIN_SECURITY:
    'پس از ورود با سوشال کلینر در توییتر، یک کلید و یک قفل با الگوریتم SHA256 برای شما تعیین میشود، که اطلاعات دریافت شده از توییتر توسط این قفل رمزنگاری شده و در دستگاه شما ذخیره میشود، بنابراین ما از اطلاعات شخصی شما اطلاعی نخواهیم داشت.',
  INTRO_BROOM_BUTTON:
    'با فشردن دکمه پاکسازی، اطلاعات شما به صورت رمزنگاری شده به همراه کد کاربری (هش) به API های سوشال کلینر ارسال میشود، در صورت آفلاین بودن، به محض اتصال دوباره اینترنت درخواست شما ارسال میشود.',
  INTRO_KILL_SWITCH_API:
    'پس از دریافت اطلاعات رمزنگاری شده شما، با کلیدی که در مرحله ورود ساخته بودیم، و هش شما، آن را باز میکنیم تا به توکن های توییتر دسترسی پیدا کنیمو از طریق API های توییتر به حذف توییت ها و پیام های شما اقدام کنیم.',
  INTRO_KILL_SWITCH_CALLBACK:
    'پس از رمزگشایی اطلاعات شما در یک صف اقدام به دریافت توییت های شما، و در صفی دیگر اقدام به پاکسازی آنها میکنیم تا زمانی که توییت دیگری برای دریافت وجود نداشته باشد',
  INTRO_BACKGROUND_PROCESS:
    'هنگامی که سوشال کلینر در حال پاکسازی فعالیت های شما در توییتر است، رابط کاربری روی دستگاه شما قفل میشود و امکان استفاده از آن وجود نخواهد داشت.',
  INTRO_SELF_DESTRUCT:
    'پس از پاکسازی توییت های شما، سرور کلید رمزگشایی شما را از دیتابیس پاکسازی میکند، همچنین اطلاعات رمزنگاری شده در دستگاه شما نیز پاکسازی خواهد شد',

  INTRO_START:
    'اگر برای استفاده از سوشال کلینر آماده هستید، دکمه شروع را فشار دهید.',
  FOR_WOMEN: 'برای زن',
  FOR_LIFE: 'برای زندگی',
  FOR_LIBERTY: 'برای آزادی',
  STAY_SAFE: 'عملیات انجام شد، با آرزوی امنیت :)',
  NEXT: 'بعدی',
  START: 'شروع',
  CANCEL: 'لغو',
  KILL_ERROR: 'مشکلی در پاکسازی پیش آمده است، دوباره وارد شوید.',
  OFFLINE:
    'شما به اینترنت وصل نیستید، به محض اتصال، درخواست شما ارسال خواهد شد',
  TECHNICAL_DETAILS: 'جزئیات فنی',
};
